Revit 2024 API
FabricationRodInfo.SetRodStructureExtension Method
 Set the length of the rod's top extension into structure. The rod must be attached to structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool SetRodStructureExtension(
	int rodIndex,
	double extension
)
Visual Basic
Public Function SetRodStructureExtension ( _
	rodIndex As Integer, _
	extension As Double _
) As Boolean
Visual C++
public:
bool SetRodStructureExtension(
	int rodIndex,
	double extension
)
Parameters
rodIndex
Type: System.Int32
 The rod index.
extension
Type: System.Double
 Distance the rod will extend into the structure.
Return Value
 Returns true if it was successful otherwise false.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  the index rodIndex is should be in range of rod count.
Autodesk.Revit.Exceptions.InvalidOperationException |  The rods do not attached to any structue.
See Also
FabricationRodInfo Class
Autodesk.Revit.DB Namespace